Aymann00/STM32F446xx-Drivers/MCAL/DMA/Src/DMA_Program.c
        /* Set Peripheral Data Size */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR &= (DMA_PSIZE_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR |= (Init->PeriphDataWidth << MSIZE);

        /* Data Transfer Direction */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR &= (DMA_DIR_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR |= (Init->Direction << DIR);

        /* Set DMA Mode */
        /* Circular OR Normal */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR &= (DMA_CIRC_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR |= (Init->Mode << CIRC);

        /* Set Memory Increment Option */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR &= (DMA_MINC_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR |= (Init->MemInc << MINC);

        /* Set Peripheral Increment Option */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR &= (DMA_PINC_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR |= (Init->PeriphInc << PINC);

        /* Set Interrupts Configurations Enabled OR Disabled */
        DMA_EnableIT(Init);

        /* FIFO Mode */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].FCR &= (DMA_DMDIS_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].FCR |= (Init->FIFOMode << DMDIS);

        /* FIFO Threshold Selection */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].FCR &= (DMA_FTH_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].FCR |= (Init->FIFOThreshold << FTH);
    }
    else
    {
        /* Configuration Are NOK */

        Local_u8ErrorStatus = DMA_WRONG_CONFIGURATION;
    }
    return Local_u8ErrorStatus;
}

/**
 * @brief : The Function Configures Interrupt Enabling Or Disabling Of All Interrupts in a Certain Stream in a Certain DMA Controller
 *
 * @param : DMA_InitConfig =>  Struct that holds all configurations of the DMA -> Check Struct ( @DMA_INIT_STRUCT_t )
 * @note  : This Function is Being Called in DMA_Init Function , So No Need to Call it Again Unless You Want to Change Interrupt Configurations
 * @return: ERRORS_t => Error Status To Indicate if Function Worked Properly
 */
ERRORS_t DMA_EnableIT(DMA_INIT_STRUCT_t *DMA_InitConfig)
{
    ERRORS_t Local_u8ErrorStatus = DMA_OK;

    if (DMA_InitConfig->EnableIT.DirectModeErrorIT < DMA_INT_DISABLE || DMA_InitConfig->EnableIT.DirectModeErrorIT > DMA_INT_ENABLE ||
        DMA_InitConfig->EnableIT.FIFOErrorIT < DMA_INT_DISABLE || DMA_InitConfig->EnableIT.FIFOErrorIT > DMA_INT_ENABLE ||
        DMA_InitConfig->EnableIT.HalfTransferIT < DMA_INT_DISABLE || DMA_InitConfig->EnableIT.HalfTransferIT > DMA_INT_ENABLE ||
        DMA_InitConfig->EnableIT.TransferCompleteIT < DMA_INT_DISABLE || DMA_InitConfig->EnableIT.TransferCompleteIT > DMA_INT_ENABLE ||
        DMA_InitConfig->EnableIT.TransferErrorIT < DMA_INT_DISABLE || DMA_InitConfig->EnableIT.TransferErrorIT > DMA_INT_ENABLE)
    {
        Local_u8ErrorStatus = DMA_NOK;
    }
    else
    {
        /* Configurations Are Correct */

        /* Transfer Complete IT */
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].CR &= (DMA_TCIE_MASK);
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].CR |= (DMA_InitConfig->EnableIT.TransferCompleteIT << TCIE);

        /* Half Transfer Interrupt */
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].CR &= (DMA_HTIE_MASK);
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].CR |= (DMA_InitConfig->EnableIT.HalfTransferIT << HTIE);

        /* Transfer Error Interrupt */
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].CR &= (DMA_TEIE_MASK);
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].CR |= (DMA_InitConfig->EnableIT.TransferErrorIT << TEIE);

        /* Direct Mode Error Interrupt */
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].CR &= (DMA_DMEIE_MASK);
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].CR |= (DMA_InitConfig->EnableIT.DirectModeErrorIT << DMEIE);

        /* FIFO Error Interrupt */
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].FCR &= (DMA_FEIE_MASK);
        DMA[DMA_InitConfig->DMAController]->STREAM[DMA_InitConfig->StreamNumber].FCR |= (DMA_InitConfig->EnableIT.FIFOErrorIT << FEIE);
    }
    return Local_u8ErrorStatus;
}

/**
 * @brief : This Function Disables a Certain Stream in a Certain DMA Controller
 *
 * @param  : DMANumber    =>  Enum that holds Options for Available DMA Controllers we have -> To choose Check enum ( @DMA_CONTROLLER_t )
 * @param  : StreamNumber => Enum that holds Options for Available Streams in the DMA Controller -> Check Options ( @DMA_STREAMS_t )
 * @return : ERRORS_t => Error Status To Indicate if Function Worked Properly
 */
ERRORS_t DMA_DisableStream(DMA_CONTROLLER_t DMANumber, DMA_STREAMS_t StreamNumber)
{
    ERRORS_t Local_u8ErrorStatus = DMA_OK;

    if (DMANumber < DMA1_CONTROLLER || DMANumber > DMA2_CONTROLLER ||
        StreamNumber < DMA_STREAM0 || StreamNumber > DMA_STREAM7)
    {
        Local_u8ErrorStatus = DMA_NOK;
    }
    else
    {
        /* Configurations Are Correct */

        DMA[DMANumber]->STREAM[StreamNumber].CR &= (DMA_EN_MASK);
    }
    return Local_u8ErrorStatus;
}

/**
 * @brief : This Function Sets Source Address & Distination Address & Enables the Stream
 *
 * @param  : InitConfig  => Struct that holds all configurations of the DMA -> Check Struct ( @DMA_INIT_STRUCT_t )
 * @param  : SrcAddress  => Pointer to a Variable that holds the Source Address
 * @param  : DestAddress => Pointer to a Variable that holds the Destination Address
 * @param  : DataLength  => Variable that holds the Number of Data Transfers
 * @return : ERRORS_t => Error Status To Indicate if Function Worked Properly
 */
ERRORS_t DMA_StartTransfer(DMA_INIT_STRUCT_t *InitConfig, uint32_t *SrcAddress, uint32_t *DestAddress, uint16_t DataLength)
{
    ERRORS_t Local_u8ErrorStatus = DMA_OK;

    if (DMA_NOK != DMA_CheckInitConfig(InitConfig))
    {
        /* Set Number of Data Transfers */
        DMA[InitConfig->DMAController]->STREAM[InitConfig->StreamNumber].NDTR = DataLength;

