Aymann00/STM32F446xx-Drivers/MCAL/DMA/Src/DMA_Program.c
        DMA_ReadInterruptFlag(DMANumber, StreamNumber, TRANSFER_ERROR_IT_FLAG, &FlagStatus);

        if (FlagStatus == DMA_FLAG_SET)
        {
            /* Transfer Error IT Occured */

            DMA_ClearInterruptFlag(DMANumber, StreamNumber, TRANSFER_ERROR_IT_FLAG);

            if (DMA1_STREAM_PTR_TOFUNC[StreamNumber][DMA_TRANSFER_ERROR_CALLBACK] != NULL && DMANumber == DMA1_CONTROLLER)
            {
                DMA1_STREAM_PTR_TOFUNC[StreamNumber][DMA_TRANSFER_ERROR_CALLBACK]();
            }
            else if (DMA2_STREAM_PTR_TOFUNC[StreamNumber][DMA_TRANSFER_ERROR_CALLBACK] != NULL && DMANumber == DMA2_CONTROLLER)
            {
                DMA2_STREAM_PTR_TOFUNC[StreamNumber][DMA_TRANSFER_ERROR_CALLBACK]();
            }
        }
        DMA_ReadInterruptFlag(DMANumber, StreamNumber, DIRECT_MODE_ERROR_IT_FLAG, &FlagStatus);

        if (FlagStatus == DMA_FLAG_SET)
        {
            /* Direct Mode Error IT Occured */

            DMA_ClearInterruptFlag(DMANumber, StreamNumber, DIRECT_MODE_ERROR_IT_FLAG);

            if (DMA1_STREAM_PTR_TOFUNC[StreamNumber][DMA_DIRECT_MODE_ERROR_CALLBACK] != NULL && DMANumber == DMA1_CONTROLLER)
            {
                DMA1_STREAM_PTR_TOFUNC[StreamNumber][DMA_DIRECT_MODE_ERROR_CALLBACK]();
            }
            else if (DMA2_STREAM_PTR_TOFUNC[StreamNumber][DMA_DIRECT_MODE_ERROR_CALLBACK] != NULL && DMANumber == DMA2_CONTROLLER)
            {
                DMA2_STREAM_PTR_TOFUNC[StreamNumber][DMA_DIRECT_MODE_ERROR_CALLBACK]();
            }
        }

        DMA_ReadInterruptFlag(DMANumber, StreamNumber, FIFO_ERROR_IT_FLAG, &FlagStatus);

        if (FlagStatus == DMA_FLAG_SET)
        {
            /* FIFO Error IT Occured */

            DMA_ClearInterruptFlag(DMANumber, StreamNumber, FIFO_ERROR_IT_FLAG);

            if (DMA1_STREAM_PTR_TOFUNC[StreamNumber][DMA_FIFO_ERROR_CALLBACK] != NULL && DMANumber == DMA1_CONTROLLER)
            {
                DMA1_STREAM_PTR_TOFUNC[StreamNumber][DMA_FIFO_ERROR_CALLBACK]();
            }
            else if (DMA2_STREAM_PTR_TOFUNC[StreamNumber][DMA_FIFO_ERROR_CALLBACK] != NULL && DMANumber == DMA2_CONTROLLER)
            {
                DMA2_STREAM_PTR_TOFUNC[StreamNumber][DMA_FIFO_ERROR_CALLBACK]();
            }
        }
    }
    return Local_u8ErrorStatus;
}

/*==============================================================================================================================================
 * HANDLERS SECTION
 *==============================================================================================================================================*/

/* ==========================
 *           DMA1
 * ========================== */

void DMA1_Stream0_IRQHandler(void)
{
    DMA_IRQHandler(DMA1_CONTROLLER, DMA_STREAM0);
}
void DMA1_Stream1_IRQHandler(void)
{
    DMA_IRQHandler(DMA1_CONTROLLER, DMA_STREAM1);
}
void DMA1_Stream3_IRQHandler(void)
{
   DMA_IRQHandler(DMA1_CONTROLLER, DMA_STREAM3);
}
void DMA1_Stream4_IRQHandler(void)
{
    DMA_IRQHandler(DMA1_CONTROLLER, DMA_STREAM4);
}
void DMA1_Stream5_IRQHandler(void)
{
    DMA_IRQHandler(DMA1_CONTROLLER, DMA_STREAM5);
}
void DMA1_Stream6_IRQHandler(void)
{
    DMA_IRQHandler(DMA1_CONTROLLER, DMA_STREAM6);
}
void DMA1_Stream7_IRQHandler(void)
{
    DMA_IRQHandler(DMA1_CONTROLLER, DMA_STREAM7);
}

/* ==========================
 *           DMA2
 * ========================== */

void DMA2_Stream0_IRQHandler(void)
{
    DMA_IRQHandler(DMA2_CONTROLLER, DMA_STREAM0);
}
void DMA2_Stream1_IRQHandler(void)
{
    DMA_IRQHandler(DMA2_CONTROLLER, DMA_STREAM1);
}
void DMA2_Stream2_IRQHandler(void)
{
    DMA_IRQHandler(DMA2_CONTROLLER, DMA_STREAM2);
}
void DMA2_Stream3_IRQHandler(void)
{
    DMA_IRQHandler(DMA2_CONTROLLER, DMA_STREAM3);
}
void DMA2_Stream4_IRQHandler(void)
{ 
    DMA_IRQHandler(DMA2_CONTROLLER, DMA_STREAM4);
}
void DMA2_Stream5_IRQHandler(void)
{
    DMA_IRQHandler(DMA2_CONTROLLER, DMA_STREAM5);
}
void DMA2_Stream6_IRQHandler(void)
{
    DMA_IRQHandler(DMA2_CONTROLLER, DMA_STREAM6);
}

void DMA2_Stream7_IRQHandler(void)
{
    DMA_IRQHandler(DMA2_CONTROLLER, DMA_STREAM7);
}
